{"podcast_details": {"podcast_title": "Up First", "episode_title": "GOP Presidential Debate, New Student Debt Relief, Runway Safety Action", "episode_image": "https://media.npr.org/assets/img/2022/09/23/up-first_tile_npr-network-01_sq-cd1dc7e35846274fc57247cfcb9cd4dddbb2d635.jpg?s=1400&c=66&f=jpg", "episode_transcript": " Eight Republicans running for the White House share a debate stage tonight in Wisconsin. The GOP frontrunner says he'll skip it to do his own interview on X. How can the others make a lasting impression? I'm Steve Inskeep with A. Martinez and this is Up First from NPR News. A new federal program aims to cut the amount of student loan repayments and the interest that goes along with them. Bundled together, this is astounding. Will critics go to court to block it? Also, safety regulators say they want to bring the number of close calls on airport runways to zero. They're organizing meetings at dozens of airports, trying to end a recent string of near misses. Stay with us. We've got all the news you need to start your day. Most of the major Republican candidates for president will be in Milwaukee tonight for the first GOP debate of the 2024 race. Now Milwaukee also will host the Republican National Convention next year, which is a sign of just how important the swing state of Wisconsin is. Donald Trump narrowly won Wisconsin in 2016 and then lost it in 2020 while pretending to win it. Tonight Trump will not be on stage. The Republican front runner declined to meet his rivals. He will instead do a separate interview with the fired Fox News host Tucker Carlson while also preparing to surrender to Georgia authorities tomorrow to face his fourth criminal indictment. This one concerns his failed efforts to stay in office after his 2020 election defeat. NPR's Franco Ordonez covers Trump and the White House is in Milwaukee for the debate. Franco, the candidates have been campaigning. It feels though like this is the official start of the race for the GOP presidential nomination. Yeah, it really is. I mean, it's a big day for Republicans. I mean, thousands of the party faithful are here. The weather has been nice. You're seeing the signs, the hats. I've talked with folks from Arkansas, Florida and Massachusetts. One Ron Kaufman, he's a party representative from Massachusetts and a long time GOP operative here's how he kind of summed up the mood. People like being here and they're pumped. I wish all the candidates were going to be here, but that's not going to change anything. All right. He's talking about Trump not going to be there tonight. What does it mean that he's not showing? I mean, Steve mentioned some of it, you know, I mean, no question it puts a damper on things. People are not happy that he's skipping, but Trump says he doesn't want to prop up his rivals being that he's so far ahead and he really is far ahead. I mean, the campaign says Americans already know what kind of president Trump's going to be so he doesn't need to sell himself like some of the lesser known candidates do. But it doesn't look as Steve noted that he's going to entirely see the spotlight. He did tease yesterday that he's going to be busy tonight. He has some counter programming planned. You know, he has that interview with former Fox News host Tucker Carlson, which could run at the same time as the debate, which is also on Fox. You mentioned earlier how Milwaukee is hosting the Republican National Convention next year. Why else has that city become so important for Republicans? I mean, really, it's critical to both parties. President Biden was actually in Milwaukee last week touting his economic record and his campaign just released a local ad doing much of the same. You know, Wisconsin is truly a state up for grabs in the last two presidential elections in 2016. Trump won by less than twenty five thousand votes. Four years later, Biden did the same thing. So Republicans may see an opportunity to win it back. That's for sure. I mean, the Wisconsin State Party chairman, Brian Schimming, says the big investment in Wisconsin for Republicans really is no accident. I always say Wisconsin isn't one of 50 states with this election. We're one of about five. And really, the White House runs through Wisconsin. You know, he really remembers when Wisconsin was considered flyover country. But now he says voters can run into presidential candidates at the convenience store. So how big, then, is the window for these candidates to make an impression? You know, they really need to seize the moment. As we said before, they are way behind. You know, it is common for a candidate who does well in the debate stage to get a bit of a bump in the polls and also in fundraising. So it's a big moment, but it could also be short lived. And that's because Trump announced he plans to travel to Georgia tomorrow and surrender to authorities. So focus is likely to turn back to Trump soon, if it ever leaves him at all. This is NPR's Franco Ordonez. Thanks a lot. Thank you. Tens of millions of borrowers who are expected to restart their student loan payments next month could be getting a break. The Education Department is starting what it's calling the most affordable repayment plan in history. So affordable that the Biden administration says many borrowers will see some or even all of their federal student loans erased. This plan is separate from the outright loan forgiveness plan that the Supreme Court struck down earlier this year. NPR's Corey Turner has been pouring through the nuts and bolts. Corey, how's this new plan going to work? Well, the idea is pretty simple. The less you make, the less you pay each month. There have been other income based plans, but this one, which they're calling the saving on a valuable education plan or the acronym SAVE, is much more generous than everything that came before. And that's really because of three big changes. So first, it's going to dramatically lower monthly payments for millions of borrowers. It's also going to increase the number of people who qualify to make no payments at all. Second, under older plans, borrowers who qualified for those low or even zero dollar monthly payments still watched interest quite often explode their loans. Now though, as long as you're paying what the government thinks you can afford, it's going to forgive any interest that's left over each month. And then the third big change is a kind of ticking clock toward forgiveness. For undergraduate borrowers who keep up with their payments for 20 years, the government promises to forgive whatever's left. That's not entirely new. What's new is if you borrowed $12,000 or less, maybe for community college, you'll only have to wait 10 years, half as long. And one more thing, this is key. The administration wants to give many borrowers back credit for the years they've already been in repayment, which obviously would then bring them that much closer to forgiveness. OK, so price tag, what's it going to cost? All right. So the administration projects that people will see their total payments per dollar borrowed overall cut by around 40%. So that's a lot of debt the Ed Department says it's ultimately going to be forgiving, which obviously has raised a lot of red flags, especially among conservatives. Here's Nat Melkis, who studies higher ed policy at the American Enterprise Institute. That means that if you borrowed $10,000, you'll only pay back $6,200 on average. That doesn't sound like a loan program. It sounds like a quasi-grant program tacked onto the end of a loan program. I should say at least one estimate suggests the cost could equal or even exceed the cost of the loan forgiveness plan the Supreme Court killed. And that was around $400 billion. I have spoken with other experts, though, who say, look, these big changes in this plan are going to help millions of low-income Americans afford their debts and access college in the future. Here's Dominique Baker. She's an associate professor of education policy at Southern Methodist University. Those are things that sound kind of policy wonky. They are incredibly impactful for people's lives. Like bundled together, this is astounding. You mentioned earlier the loan forgiveness plan the Supreme Court killed. What are the chances that this will face legal challenges? I think it's inevitable it will face legal challenge, though most of the folks I've talked to about this, even those who don't like the plan, say this one is on safer legal footing. NPR education correspondent Corey Turner. Corey, thanks for looking into this. You're welcome, A. The Federal Aviation Administration has taken on a string of near misses on the runway and will draw attention to safety in dozens of meetings at about 90 U.S. airports. Southwest to board. FedEx is on the go. FedEx is on the go. That's what it sounded like back on February 4th for the pilot of a Southwest Airlines flight. The plane had been cleared to take off from Austin. A FedEx cargo plane had been told to use the same runway and could have landed on the passenger plane with 131 people on board if it hadn't changed course. That's one of multiple serious close calls tracked by the FAA this year. Andrew Tangles on the line. He's an aviation reporter for the Wall Street Journal. Andrew, the FAA tracks these near misses on the ground and in the air. How has this year been different? The FAA classifies these incidents with different ranks of seriousness. And earlier this year, there was a spate of close calls at runways around the country that were the most serious that the FAA tracks. And so regulators were alarmed enough to put the focus on these so-called runway incursions. They held a big meeting in the Washington DC area. They brought in airlines, pilots, airport operators to try to figure out what's going on. And these forthcoming meetings at US airports are an extension of that effort. All right, so how are these meetings going to achieve what the FAA wants, which is zero close calls? They're ultimately trying to tell everyone in the industry to keep their head in the game and be extra vigilant about safety issues. They are trying to figure out what happened in each of these close calls. They are also trying to figure out what could tie them all together systemically, what could be the underlying cause. They're trying to understand why there are these mistakes, either by pilots or air traffic controllers, what have you. The industry in the US has all but eliminated major fatal airline crashes. There hasn't been one with a major US airline. Past 14 years, which is remarkable by historical standards, and now suddenly things are getting way too close and they're trying to figure out why and keep it from even getting that close. So these close calls, the high number of these near misses, is it possibly because of increased traffic after the pandemic? That is one of the concerns. There are a lot more airplanes to manage flying around, adding to the stress of an already constrained system. Air traffic control towers are understaffed. There are younger and newer members of the workforce, not only in air traffic control, but also at airlines in the cockpit. The pilots are facing new pressures. The traditional career path has been accelerated given there are so many retirements during the pandemic when nobody was flying. And suddenly you've got younger pilots progressing to bigger planes, becoming captain in command of new airplanes that they are less experienced dealing with than maybe a counterpart might have been 10 or 15 years ago. All right. That's the Wall Street Journal's Andrew Tangl. Andrew, thanks. Thank you. And that's Up First for Wednesday, August 23rd. I'm Ian Martinez. And I'm Steve Inskeep. Up First is produced by Mansi Karana and Claire Murashima. Our editors are Megan Pratz, Steve Drummond, Jan Johnson, and Alice Wolfley. Our director is Lily Kiros, and our technical director is Zach Coleman with engineering support from Hannah Glovna. And if you like your news on demand, and I know that you do, check out the NPR One app. You get to mix a local, national, and international news whenever you want it and wherever you go. So hear podcasts based on what you like as well. Download NPR One at that app store."}, "podcast_summary": "In the latest podcast, several important topics were discussed. Firstly, the Republican National Convention and GOP debate in Wisconsin were highlighted, with the absence of frontrunner Donald Trump being a significant point of discussion. The importance of Wisconsin as a swing state was emphasized, with both parties investing heavily in the region.\n\nAnother major topic covered was a new federal program aimed at reducing student loan repayments and interest. This program, known as the Saving on a Valuable Education plan (SAVE), offers more generous terms than previous income-based plans. It lowers monthly payments, forgives any remaining interest, and promises forgiveness of the remaining loan after a certain number of years, depending on the amount borrowed.\n\nLastly, the Federal Aviation Administration's efforts to address and prevent close calls on airport runways were mentioned. Meetings are being organized at multiple airports to discuss and identify the causes of these incidents, with increased traffic and workforce challenges being potential contributing factors.\n\nOverall, the podcast provided valuable insights into the current political landscape, student loan repayment options, and aviation safety measures.", "podcast_guest": {"name": "Eight Republicans"}, "podcast_highlights": "- Highlight 1: \"People are not happy that he's skipping, but Trump says he doesn't want to prop up his rivals being that he's so far ahead and he really is far ahead.\"\n- Highlight 2: \"As we said before, they are way behind. You know, it is common for a candidate who does well in the debate stage to get a bit of a bump in the polls and also in fundraising.\"\n- Highlight 3: \"The idea is pretty simple. The less you make, the less you pay each month. There have been other income based plans, but this one, which they're calling the saving on a valuable education plan or the acronym SAVE, is much more generous than everything that came before.\"\n- Highlight 4: \"Now though, as long as you're paying what the government thinks you can afford, it's going to forgive any interest that's left over each month.\"\n- Highlight 5: \"They are ultimately trying to tell everyone in the industry to keep their head in the game and be extra vigilant about safety issues.\""}